Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/views/cat_rental_requests/new.html.erb


    <% Cat.all.each do |cat| %>
---
SELECT "cats".* FROM "cats"