Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/views/posts/_form.html.erb

        <input type="hidden" name="post[sub_ids][] value="">
        <% Sub.all.each do |sub| %>
---
SELECT "subs".* FROM "subs"