Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/views/posts/show.html.erb

    <ul>
        <% @all_comments.select { |cm| cm.p_comment_id.nil? }.each do |cm| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]