Immersive_Course_Folders/W4/RecordLabel-Site/MusicLabel/app/views/albums/_form.html.erb

SELECT "bands".* FROM "bands"
---
      <option disabled <%= "selected" unless band%>>"--select band--"<option>
        <% Band.all.each do |bd| %>