Immersive_Course_Folders/W4/RecordLabel-Site/MusicLabel/app/views/albums/edit.html.erb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<%= render 'form', album: @album, band: Band.find(params[:id]) %>