Immersive_Course_Folders/W4/RecordLabel-Site/MusicLabel/app/controllers/albums_controller.rb

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def new
    if params.has_key?(:band_id)
      @band = Band.find(params[:band_id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 2]]
---
  def destroy
    album = Album.find(params[:id])
    band = album.band
    album.destroy

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["year", 2010], ["updated_at", "2019-07-20 01:32:50.013997"], ["id", 1]]
---
  def update
    @album = Album.find(params[:id])

    if @album
      @album.update(wanted_params)