Immersive_Course_Folders/W4/RecordLabel-Site/MusicLabel/app/controllers/bands_controller.rb

  def create
    @band = Band.create(wanted_params)
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Red Hot Chilli"], ["created_at", "2019-07-18 16:02:39.336880"], ["updated_at", "2019-07-18 16:02:39.336880"]]

  def destroy
    band = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @band = Band.find(params[:id])
    if @band
      @band.update(wanted_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "name" = ?, "updated_at" = ? WHERE "bands"."id" = ?  [["name", "Red Hot Chilli Peppers"], ["updated_at", "2019-07-18 16:02:55.506202"], ["id", 2]]