Immersive_Course_Folders/W4/RecordLabel-Site/MusicLabel/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @usr = User.find(params[:id])

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @usr = User.new(wanted_params)
    if @usr.save!