Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
    def index
        post, parentCmt = nil
        if params[:post]
            post = Post.find(params[:post])
        end
        if params[:pCmt]
            parentCmt = Comment.find(params[:pCmt])
        end
        @athrName = []
            if parentCmt
                parentCmt.child_comments.each { |cmt| @athrName.push(cmt.author.name) }