Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/controllers/comments_controller.rb

    def index
        post = Post.find(params[:post]);
        @comments = post.comments.where(p_comment_id: nil);
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."p_comment_id" = ?  [["p_comment_id", 23]]

    def create
        @comment = Comment.new(wanted_params)
        if @comment.save!
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "p_comment_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "Testing author label "], ["author_id", 5], ["post_id", 4], ["created_at", "2020-05-09 09:21:55.780879"], ["updated_at", "2020-05-09 09:21:55.780879"], ["p_comment_id", 23]]