Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def show
        @post = Post.find(params[:id])
        @all_comments = @post.comments.includes(:author)

INSERT INTO "posts" ("title", "content", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Prime Target!"], ["content", "I love his antics!!"], ["author_id", 3], ["created_at", "2019-08-18 00:56:47.862613"], ["updated_at", "2019-08-18 00:56:47.862613"]]
INSERT INTO "sub_posts" ("sub_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sub_id", 1], ["post_id", 6], ["created_at", "2020-04-10 03:36:18.011277"], ["updated_at", "2020-04-10 03:36:18.011277"]]
---
    def create
        @post = Post.new(wanted_params)
        @post.author_id = current_user.id

        if @post.save!
            @sbPost = SubPost.new(post_id: @post.id, sub_id: params[:post][:link].to_i)
            @sbPost.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "He imitates my family members ALL THE TIME!"], ["updated_at", "2019-08-17 21:52:30.297257"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])
        @post.update_attributes(wanted_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
    def destroy
        @usr = User.find(params[:usrId])
        @trd = Post.find(params[:id])

        if @usr.is_pass?(params[:password])
            @trd.delete