Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @usr = User.find(params[:id])

INSERT INTO "users" ("name", "email", "pass_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        @usr = User.new(wanted_params)

        if @usr.save!

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @usr = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "sabitman@hotmail.com"], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "pass_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Sabito"], ["pass_digest", "$2a$12$S.emIeux8i3YAnvIg3YQ5e9VBYaMI9fHcAlDVsnWkTujsns8oO.QK"], ["updated_at", "2019-08-17 04:07:45.594138"], ["id", 1]]
---
    def update
        @usr = User.find_by(email: params[:user][:email])
        @usr.update_attributes(wanted_params)