Immersive_Course_Folders/w5/D2FinalRbProj/MyReddit/app/models/user.rb

INSERT INTO "users" ("name", "email", "pass_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "session_token" = ? WHERE "users"."id" = ?  [["updated_at", "2020-04-02 01:08:07.297105"], ["session_token", "jPU1xE-ewgf6uxZqHRSirQ"], ["id", 5]]
---
    def reset_session_tkn!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save

INSERT INTO "users" ("name", "email", "pass_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def password=(pass)
        @password = pass
        self.pass_digest = BCrypt::Password.create(pass)
        self.save!