Immersive_Course_Folders/w5/D2/MyReddit/app/views/comments/show.html.erb

    <ul>
    <% Comment.where(p_comment_id: @comment.id).each do |cm| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."p_comment_id" = ?  [["p_comment_id", 4]]