Immersive_Course_Folders/W4/Cat-Site/ShopCatOutF/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "O9KijVrjOx-744XOq4Q3vg"], ["LIMIT", 1]]
---
  def current_usr
    return nil unless session[:session_token]
    @current_usr ||= User.find_by(session_token: session[:session_token])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def check_usr!
    wanted_cat = Cat.find(params[:id])

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def check_usr_bool?
    wanted_cat = Cat.find(params[:id])