Immersive_Course_Folders/W4/FirstRt/app/controllers/artwork_shares_controller.rb

  def create
    new_art_share = ArtworkShare.new(wannted_params)
    if new_art_share.save!
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artwork_id", 2], ["viewer_id", 5], ["created_at", "2019-06-22 22:46:33.207833"], ["updated_at", "2019-06-22 22:46:33.207833"]]

  def destroy
    desired_obj = ArtworkShare.find(params[:id])
    if desired_obj.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = ?  [["id", 4]]