Immersive_Course_Folders/W4/FirstRt/app/controllers/artworks_controller.rb

  def index
    # if params[:user_id]
      usr, ans = User.find(params[:user_id]), []
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    picture = Artwork.find(params[:id])
    if picture.update(wanted_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = ?, "updated_at" = ? WHERE "artworks"."id" = ?  [["title", "Pleased"], ["updated_at", "2019-06-21 20:15:24.307346"], ["id", 4]]