Immersive_Course_Folders/W4/FirstRt/app/controllers/comments_controller.rb

  def index
    if wanted_params[:artist_id]
      ans = Comment.where(artist_id: wanted_params[:artist_id])
    elsif wanted_params[:artwork_id]
      ans = Comment.where(artwork_id: wanted_params[:artwork_id])
---
SELECT "comments".* FROM "comments" WHERE "comments"."artist_id" = ?  [["artist_id", 4]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = ?  [["artwork_id", 3]]

  def create
    ans = Comment.new(wanted_params)
    if ans.save!
---
INSERT INTO "comments" ("artist_id", "artwork_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist_id", 5], ["artwork_id", 4], ["body", "I respect this topic"], ["created_at", "2019-06-23 18:58:46.388959"], ["updated_at", "2019-06-23 18:58:46.388959"]]

  def destroy
    ans = Comment.find(params[:id])
    if ans.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 4]]