Immersive_Course_Folders/W4/FirstRt/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "darknight3"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
  def index
    if params[:query]
      ans = User.find_by(username: params[:query][:username])
    else
      ans = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def show
    wanted_obj = User.find(params[:id])

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "superman1789"], ["created_at", "2019-06-21 21:53:09.174423"], ["updated_at", "2019-06-21 21:53:09.174423"]]
---
  def create
    n_user = User.new(wanted_params)

    if n_user.save!