Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/controllers/application_controller.rb

  def current_usr
    return nil unless session[:session_token]
    @current_usr ||= User.find_by(session_token: session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "t"], ["LIMIT", 1]]