Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/controllers/cat_rental_requests_controller.rb

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @req = CatRentalRequest.find(params[:id])

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["cat_id", 2], ["start_date", "2019-08-10"], ["end_date", "2019-10-25"], ["created_at", "2019-07-11 20:39:47.566252"], ["updated_at", "2019-07-11 20:39:47.566252"], ["user_id", 4]]
---
  def create
    @req = CatRentalRequest.new(wanted_params)
    if @req.save!

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def approve
    ans = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def deny
    ans = CatRentalRequest.find(params[:id])