Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(wanted_params)

    if @cat.save!
---
INSERT INTO "cats" ("name", "birth_date", "sex", "color", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @cat = Cat.find_by(id: params[:id])

    if @cat.update_attributes(wanted_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = ?, "updated_at" = ? WHERE "cats"."id" = ?  [["description", "Prime example of the definition \"Domesticated\"!!!"], ["updated_at", "2019-06-29 23:49:01.437640"], ["id", 3]]