Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @usr = User.new(wanted_params)
    if @usr.save!