Immersive_Course_Folders/w5/D2/MyReddit/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 3]]
---
    def show
        @post = Post.find(params[:id])
        @all_comments = @post.comments.includes(:author)

INSERT INTO "posts" ("title", "content", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Prime Target!"], ["content", "I love his antics!!"], ["author_id", 3], ["created_at", "2019-08-18 00:56:47.862613"], ["updated_at", "2019-08-18 00:56:47.862613"]]
---
    def create
        @post = Post.new(wanted_params)
        @post.author_id = current_user.id

        if @post.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "He imitates my family members ALL THE TIME!"], ["updated_at", "2019-08-17 21:52:30.297257"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])
        @post.update_attributes(wanted_params)