Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/models/cat_rental_request.rb

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? AND "cat_rental_requests"."id" != ? AND (start_date >= '2019-01-10' OR end_date >= '2019-01-10' ) AND (status = 'APPROVED' ) LIMIT ?  [["cat_id", 3], ["id", 9], ["LIMIT", 1]]
---
  def donnot_overlep_aprvd_req
    if self.status == "APPROVED"
      self.errors[:aprvd] << "req already exists for these dates" unless self.overlapping_approved_req.empty?

UPDATE "cat_rental_requests" SET "status" = ?, "updated_at" = ? WHERE "cat_rental_requests"."id" = ?  [["status", "APPROVED"], ["updated_at", "2019-07-03 02:36:12.801731"], ["id", 9]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? AND "cat_rental_requests"."id" != ? AND (start_date >= '2019-01-10' OR end_date >= '2019-01-10' )  [["cat_id", 3], ["id", 9]]
---
  def approve!
    raise "Request not pending" unless self.status == "PENDING" || self.status == "DENIED"
    transaction do
      self.status = "APPROVED"
      self.save!

      self.overlapping_req.each { |req| req.update!(status: "DENIED") }

UPDATE "cat_rental_requests" SET "status" = ?, "updated_at" = ? WHERE "cat_rental_requests"."id" = ?  [["status", "DENIED"], ["updated_at", "2019-07-03 02:37:38.947701"], ["id", 9]]
---
  def deny!
    self.update!(status: "DENIED") unless self.status == "DENIED"