Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/models/user.rb

INSERT INTO "users" ("user_name", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "geTbM4PTUTKzYTzIx7Zd-g"], ["updated_at", "2019-07-11 20:05:28.027288"], ["id", 4]]
---
  def reset_session_token!
    self.session_token = SecureRandom::urlsafe_base64(16)
    self.save!

INSERT INTO "users" ("user_name", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def password=(pass)
    @password = pass
    self.password_digest = BCrypt::Password.create(pass)
    self.save

SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "Superman1789"], ["LIMIT", 1]]
---
  def self.find_by_credentials(usr_n, pass)
    usr = User.find_by(user_name: usr_n)