Immersive_Course_Folders/W4/FirstRt/app/models/artwork_share.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def author_cannot_view
    art = Artwork.find(self.artwork_id)