Immersive_Course_Folders/w5/D2/MyReddit/app/views/subs/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."sub_id" = ?  [["sub_id", "1"]]
---
    <ul>
    <% Post.all.each do |p| %>