Immersive_Course_Folders/w7/TodoP3/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "latifuahad"], ["LIMIT", 1]]
---
    def create
        usr = User.find_by(username: params[:user][:username])