Immersive_Course_Folders/w7/TodoP3/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]
---
    def destroy
        @usr = User.find(params[:id])
        @usr.delete