Immersive_Course_Folders/W4/Cat-Site/ShopCatOutF/app/models/cat_rental_request.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def overlapping_req
    ans = CatRentalRequest
    .where(cat_id: cat_id)
    .where.not(id: id)
    .where("start_date >= ? OR end_date >= ? ", start_date, start_date)

SELECT  1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? AND "cat_rental_requests"."id" != ? AND (start_date >= '2019-01-10' OR end_date >= '2019-01-10' ) AND (status = 'APPROVED' ) LIMIT ?  [["cat_id", 3], ["id", 9], ["LIMIT", 1]]
---
  def donnot_overlep_aprvd_req
    if self.status == "APPROVED"
      self.errors[:aprvd] << "req already exists for these dates" unless self.overlapping_approved_req.empty?

UPDATE "cat_rental_requests" SET "status" = ?, "updated_at" = ? WHERE "cat_rental_requests"."id" = ?  [["status", "APPROVED"], ["updated_at", "2019-07-03 02:36:12.801731"], ["id", 9]]
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = ? AND "cat_rental_requests"."id" != ? AND (start_date >= '2019-01-10' OR end_date >= '2019-01-10' )  [["cat_id", 3], ["id", 9]]
UPDATE "cat_rental_requests" SET "status" = ?, "updated_at" = ? WHERE "cat_rental_requests"."id" = ?  [["status", "DENIED"], ["updated_at", "2019-07-03 02:37:38.947701"], ["id", 9]]
---
  def approve!
    raise "Request not pending" unless self.status == "PENDING" || self.status == "DENIED"
    transaction do
      self.status = "APPROVED"
      self.save!

      self.overlapping_req.each { |req| req.update!(status: "DENIED") }