Immersive_Course_Folders/w5/D2/MyReddit/app/models/user.rb

    def reset_session_tkn!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save
---
INSERT INTO "users" ("name", "email", "pass_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "LTWu7_TjbD-mQhG2PFjixw"], ["updated_at", "2019-08-18 17:59:12.149279"], ["id", 1]]