Immersive_Course_Folders/w7/TodoP3/app/models/user.rb

    def setupUsr
        pass = self.password
        self.password=(pass) unless !self.pass_digest.empty?
---
SELECT  1 AS one FROM "users" WHERE "users"."pass_digest" = $1 AND "users"."id" != $2 LIMIT $3  [["pass_digest", "$2a$12$FfEfmyy2FEcJzV0NeGMI5OyeY3t0yK/qozh5WRCs6nKWyxCMRx5AG"], ["id", 2], ["LIMIT", 1]]

    def reset_session_tkn!
        self.session_token = SecureRandom::urlsafe_base64(16)
        self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "yb_NUm0bz6TNxQQGDPdGxw"], ["updated_at", "2020-01-07 00:37:11.745050"], ["id", 2]]

    def password=(pass)
        @password = pass
        self.pass_digest = BCrypt::Password.create(pass)
        self.save!
---
INSERT INTO "users" ("username", "pass_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "NT9ZrXsoIWEj-fUeMYbF3A"], ["updated_at", "2020-01-09 03:09:44.686228"], ["id", 2]]