Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/views/cats/_form.html.erb


    <% Cat::ACCEPTABLE_COLORS.each do |cl| %>
---
SELECT  "cats".* FROM "cats" WHERE (3) LIMIT ?  [["LIMIT", 1]]