Immersive_Course_Folders/W4/99cats/ShopCatOutF/app/views/cats/_req_opt.html.erb

  <% return if req.user_id == 0 %>
  <% user = User.find(req.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]