Immersive_Course_Folders/w7/TodoP3/app/controllers/api/steps_controller.rb

    def index
       steps = Todo.find(params[:todo_id]).steps
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
SELECT "steps".* FROM "steps" WHERE "steps"."todo_id" = $1  [["todo_id", 38]]

    def create
        step = Step.new(wntedParams)
        if step.save!
---
INSERT INTO "steps" ("title", "todo_id", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Splash water"], ["todo_id", 27], ["done", false], ["created_at", "2020-01-05 07:40:49.879351"], ["updated_at", "2020-01-05 07:40:49.879351"]]

    def update
        step = Step.find(params[:id])
        step.update(wntedParams)
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "steps" SET "done" = $1, "updated_at" = $2 WHERE "steps"."id" = $3  [["done", true], ["updated_at", "2020-01-05 22:52:29.590974"], ["id", 1]]

    def destroy
        step = Step.find(params[:id])
        if(step)
            step.delete
---
SELECT  "steps".* FROM "steps" WHERE "steps"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "steps" WHERE "steps"."id" = $1  [["id", 3]]