Immersive_Course_Folders/w7/TodoP3/app/controllers/api/todos_controller.rb

INSERT INTO "todos" ("id", "title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 5], ["title", "Buy a car"], ["body", "Save money"], ["done", false], ["created_at", "2020-01-03 04:06:30.704490"], ["updated_at", "2020-01-03 04:06:30.704490"]]
---
    def create
        @todo = Todo.new(todo_params)
        if @todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "todos" SET "done" = $1, "updated_at" = $2 WHERE "todos"."id" = $3  [["done", true], ["updated_at", "2020-01-03 23:29:01.538274"], ["id", 3]]
---
    def update
        @wntedTodo = Todo.find(params[:id])
        @wntedTodo.update(wanted_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 4]]
---
    def destroy
        @todo = Todo.find(params[:id])
        if @todo
            @todo.delete